---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.RecursionParameterIgnored
source: html/7e80ed1f-fcf4-64ce-bf45-a39f091a3a2e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.RecursionParameterIgnored Property

Parameter-defined type of curtain panels defined in a circular way and will be ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId RecursionParameterIgnored { get; }
```